kell5/esp32_ble_mesh/camera_stream/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# PSRAM (octal) - required for camera frame buffers
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# HTTP server tuning for MJPEG streaming
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Larger single app partition
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_FREERTOS_HZ=1000

# Enable protocomm Security1 (x25519 + PoP) for SoftAP WiFi provisioning
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y

# --- Deployment: server endpoints (WiFi set at runtime via phone provisioning) ---
CONFIG_EXAMPLE_RELAY_HOST="114.55.208.72"
CONFIG_EXAMPLE_RELAY_PORT=8090
CONFIG_EXAMPLE_MQTT_BROKER_URI="mqtt://121.40.131.194:1883"
